export type TelegramReviewSeed = {
  title: string;
  text: string;
  telegramFileId: string;
  image: string | null;
};

export const telegramReviewSeeds = [
  {
    "title": "Отзыв 20",
    "text": "ASIA TRADE CAR\nПривезла авто с выбранной комплектацией и состоянием,в короткий срок из Кореи.\nЕще и успели растаможить до поднятия утильсбора!\n100% прозрачность сделки!\nПрофессионально подходят к своему дела от и до.\nРекомендую данную компанию.\nБольшое спасибо , особенно Павлу.",
    "telegramFileId": "telegram-import:2210",
    "image": "/media/reviews/telegram-2210.webp"
  },
  {
    "title": "Отзыв 21",
    "text": "Хочу выразить благодарность Павлу за помощь в покупке автомобиля из Китая! Помогал при подборе автомобиля, предоставил множество вариантов подходящих для меня автомобилей и постоянно был на связи. Помимо покупки и оформления документов Павел организовал доставку автомобиля в г.Томск наиболее эффективным образом, при этом подобрал все необходимое в г.Владивосток по очень выгодным ценам. Данный автомобиль приехал в прекрасном состоянии и с минимальным пробегом. Очень советую услуги команды Asia Trade Car, а в частности услуги Павла!",
    "telegramFileId": "telegram-import:2217",
    "image": null
  },
  {
    "title": "Отзыв 22",
    "text": "Спасибо большое Павлу за подборку и доставку автомобиля до Томска. Отвественный и надёжный парень. Всегда был на связи, помогал решать все нюансы, всегда отвечал на вопросы. Машиной доволен, всё соответствует заявленным требованиям.\nОбращайтесь к Павлу, не пожалеете. Больше спасибо Паша 🤝",
    "telegramFileId": "telegram-import:2220",
    "image": "/media/reviews/telegram-2220.webp"
  },
  {
    "title": "Отзыв 23",
    "text": "Огромное спасибо Павлу, за приобретение автомобиля из Китая. Оказал помощь при выборе автомобиля, из множества предложенных вариантов.\nТакже без проблем, давал ответы и пояснения на вопросы, касаемые покупки автомобиля, всегда был на связи.\nКупленный автомобиль соответствует всем нашим пожеланиям, это касается и его состояния и комплектации и характеристик.\nСпасибо команде Asia Trade Car, и отдельное спасибо Павлу за работу!\nРекомендую услуги этой команды!👍",
    "telegramFileId": "telegram-import:2224",
    "image": null
  },
  {
    "title": "Отзыв 24",
    "text": "Хочу выразить огромную благодарность команде Asia Trad Car за отличный! Автомобиль подобран по всем нашим параметрам нам подобрали то что и нужно было . Связь поддерживали на каждом этапе до прибытия автомобиля в Томск . Сервис на высшем уровне рекомендую всем друзьям и знакомым, ещё раз спасибо большое команде Asia Trad Car",
    "telegramFileId": "telegram-import:2234",
    "image": "/media/reviews/telegram-2234.webp"
  },
  {
    "title": "Отзыв 25",
    "text": "Хочу выразить огромную благодарность компании Asia Trade Car и в частности Павлу! Помощь в выборе, экспертиза,оформление, доставка- все очень быстро, понятно, с пояснениями и ответами на все вопросы. Машину получила после мойки, переобутую😅) состояние полностью соответствует заявленному. Кто еще решает заказывать или купить в России, но переплатить большую сумму-НЕ ДУМАЙТЕ!!!! Стоит подождать и получить авто по приятной цене, с небольшим пробегом! Спасибо, Павел!",
    "telegramFileId": "telegram-import:2237",
    "image": "/media/reviews/telegram-2237.webp"
  },
  {
    "title": "Отзыв 26",
    "text": "Выражаю огромную благодарность компании ASIA TRADE, в частности Олегу и Павлу, за помощь в подборе автомобиля. Всегда были на связи, отвечали на вопросы и помогали советом. Буду обязательно рекомендовать знакомым 🤗",
    "telegramFileId": "telegram-import:2244",
    "image": "/media/reviews/telegram-2244.webp"
  },
  {
    "title": "Отзыв 27",
    "text": "Спасибо Павлу за профессионализм,прозрачность процесса и качество обслуживания.Подобрал лучший вариант по комплектации в мой бюджет.Подробно объяснил,рассказал про все этапы доставки машины.Машина приехала в отличном состоянии,как обещали меньше чем за полтора месяца.Сработано все четко,оперативно,с фото и видеоотчетамина каждом этапе.Молодцы!!!Все прошло гладко и без проблем.Вишенка на торте-🍾Prosecco.",
    "telegramFileId": "telegram-import:2247",
    "image": "/media/reviews/telegram-2247.webp"
  },
  {
    "title": "Отзыв 28",
    "text": "Большое спасибо ребятам из ASIA TRADE CAR за предоставленные услуги по подбору авто. Все моменты по выбору, покупке и доставке отработали слаженно. Отдельное спасибо менеджеру Артуру, за оперативность и компетентность.",
    "telegramFileId": "telegram-import:2250",
    "image": "/media/reviews/telegram-2250.webp"
  },
  {
    "title": "Отзыв 29",
    "text": "Большое спасибо компании Asia Trade, а именно Олегу!!! Быстро нашли отличный вариант, подходящий по всем критериям. Олег сопровождал сделку от начала и до конца, все объяснял и отвечал на все вопросы! На связи был 24/7\nОднозначно рекомендую всем!!!\nА самое главное что машина действительно без всяких скрытых сюрпризов!",
    "telegramFileId": "telegram-import:2259",
    "image": "/media/reviews/telegram-2259.webp"
  },
  {
    "title": "Отзыв 30",
    "text": "Работой компаний доволен.Менеджер Олег постоянно держал в курсе,присылал фото на каждом этапе.Итоговая стоимость машины приятно удивила,получилось даже дешевле,чем планировали.За следующей машиной только в ASIA TRADE CAR 👍👍👍👍",
    "telegramFileId": "telegram-import:2265",
    "image": "/media/reviews/telegram-2265.webp"
  },
  {
    "title": "Отзыв 31",
    "text": "Выражаем большую благодарность компании ASIA TRADE CAR и Павлу лично за помощь в приобретении автомобиля тойота королла с доставкой в Нижний Новгород. Процесс покупки прошел максимально комфортно, Павел всегда был на связи и отвечал на все возникающие вопросы. Машина оправдала наши ожидания и порадовала итоговой стоимостью. Большое спасибо и процветания вашей компании. 🤝",
    "telegramFileId": "telegram-import:2269",
    "image": "/media/reviews/telegram-2269.webp"
  },
  {
    "title": "Отзыв 32",
    "text": "Огромная благодарность компании и лично Павлу за оперативную и качественную покупку и доставку автомобиля👍🏻",
    "telegramFileId": "telegram-import:2274",
    "image": "/media/reviews/telegram-2274.webp"
  },
  {
    "title": "Отзыв 33",
    "text": "Большое спасибо компании за качественно подобранный по нашим требованиям автомобиль!!! А именно Олегу! Полное сопровождение по всем этапам, быстрая связь( вопрос- ответ). Рекомендую вашу компанию всем своим друзьям и знакомым. Процветания вам и много клиентов!❤️",
    "telegramFileId": "telegram-import:2281",
    "image": "/media/reviews/telegram-2281.webp"
  },
  {
    "title": "Отзыв 34",
    "text": "Здравствуйте! Выражаю благодарность Компании ASIA TRADE CAR и отдельно лично Павлу Платонову за помощь в приобретении автомобиля Lexus NX 200 с доставкой в Владивосток из Китая. Сборка автомобиля Япония. Процесс подбора, выбора, диагностики, покупки прошел максимально качественно и оперативно. Павел всегда был на связи и отвечал на все возникающие вопросы. Машиной и её состоянием довольны, стоимость порадовала! Большое спасибо, крепко жму руку Павел. 🤝 Рекомендую всем друзьям и знакомым. Ещё одна машинка подобрана друзьям, после нашей покупки и скоро приедет. 👍",
    "telegramFileId": "telegram-import:2292",
    "image": "/media/reviews/telegram-2292.webp"
  },
  {
    "title": "Отзыв 35",
    "text": "Заказали замечательный семейный автомобиль через компанию ASIA TRADE CAR! На всех этапах специалисты компании на связи, консультируют, помогают с выбором! Автомобиль приехал, мы очень рады! Большое спасибо!!! 🎈🎈🎈🚗🏎️🍾🍾🍾",
    "telegramFileId": "telegram-import:2298",
    "image": "/media/reviews/telegram-2298.webp"
  },
  {
    "title": "Отзыв 36",
    "text": "Благодорим Артура и всю команду Asia Trade Car за полное сопровождение в процессе приобретения автомобиля.\nАвтомобиль пришёл как на фото и видео в идеальном состоянии,Артур помогал с машиной и после приобретения,консультировал по эксплуатации, поставили на учёт без каких либо проблем. Один месяц и машина у меня!!!\nОгромная благодарность Артуру и всей команде Asia Trade Car всем!!!\nПроцветания Вам!!!",
    "telegramFileId": "telegram-import:2310",
    "image": "/media/reviews/telegram-2310.webp"
  },
  {
    "title": "Отзыв 37",
    "text": "Хочу оставить отзыв о своем спонтанном решении и нисколько о нем не жалею. Заказала авто у Павла, на всем протяжении терпеливо отвечал на все мои вопросы и консультировал на каждом этапе. Возникли непредвиденные обстоятельства на таможне, но Павел объяснил все возможные развития событий и успокоил. Вошёл с пониманием к сложившимся обстоятельствам и не изменил стоимость авто за что ему отдельная благодарность! И теперь моя красотка радует меня!\nРекомендую компанию Asia trade car и Павла всем!",
    "telegramFileId": "telegram-import:2321",
    "image": "/media/reviews/telegram-2321.webp"
  },
  {
    "title": "Отзыв 38",
    "text": "Я приобрела Toyota Corolla через AsiaTradeCar. Всё прошло чётко: от подбора до оформления. Покупку сопровождал Павел: оперативно отвечал, подробно консультировал, был включенным на каждом этапе вплоть до постановки автомобиля на учет.\nУ меня не было опыта дистанционного приобретения автомобиля и были некие опасения про сложность, а всё оказалось легко и понятно.\nПолучила автомобиль в идеальном состоянии, который полностью соответствует описанию.\nЯ очень довольна сотрудничеством, рекомендую!🤗",
    "telegramFileId": "telegram-import:2329",
    "image": "/media/reviews/telegram-2329.webp"
  },
  {
    "title": "Отзыв 39",
    "text": "Всех приветствую.\nХочу выразить большую благодарность менеджеру Артуру, заказывал VW Golf R-Line, машина пришла оперативно и в точности как была заявлена.\nАртур занимался полным сопровождением и был 24/7 на связи для консультации , все отчёты и подбор автомобиля был согласованн полностью, покупкой очень доволен и рад , всем советую данную компанию для заказов авто, за такие деньги с таким пробегом авто в России не найти. 👍",
    "telegramFileId": "telegram-import:2332",
    "image": "/media/reviews/telegram-2332.webp"
  },
  {
    "title": "Отзыв 40",
    "text": "Хочу выразить огромную благодарность Павлу и компании ASIA TRADE CAR за выгодную покупку отличного автомобиля Toyota Corolla!!!\nПодход к каждому клиенту максимально индивидуальный с учётом всех пожеланий, что позволяет подобрать надёжный, стильный и комфортный автомобиль. Подробная консультация по каждому возникающему вопросу в любое время суток,что позволяет чувствовать,что немаловажная сделка по купли-продажи транспортного средства находится в надёжных руках. Несмотря на то,что сделка выполнена на высшем уровне и машина уже в руках нового собственника, Павел продолжает консультировать по любым возникающим вопросам, даёт замечательные дельные советы и предлагает свою помощь. Большую благодарность выражаем Павлу и всей команде!",
    "telegramFileId": "telegram-import:2336",
    "image": "/media/reviews/telegram-2336.webp"
  },
  {
    "title": "Отзыв 41",
    "text": "Когда принял решение о заказе автомобиля из Китая было пересмотрено очень много компаний по привозу автомобилей из-за рубежа. Стоимость автомобиля не маленькая, страхов быть обманутым было много. Все, с кем контактировал вместо работы с клиентом либо писали уже заготовленные тексты, либо озвучивали ценники, на автомобили, которые продаются по верху рынка (если смотреть по китайским торговым площадкам), доверия такой подход не вызывал. Несколько хороших знакомых посоветовали обратиться к Павлу из компании Asia trade car, мол машины уже приобретали с его помощью и остались крайне довольны. Связался с Павлом, он не стал общаться рядовыми отписками, а довольно быстро перезвонил и не пожалел своего времени и ответил на все мои вопросы (долгий разговор получился). После чего составили договор и начали подбирать авто. В общей сложности доставка заняла чуть меньше двух месяцев от момента подбора до прибытия в город Томск. Уложились в средний срок, который изначально и озвучил Павел. Хочу выразить ему отдельную благодарность в качественном сопровождении всего процесса покупки, если возникали какие-то вопросы или сложности он достаточно оперативно и в полной мере оказывал помощь. Отзыв пишу поздно, вот уже полтора месяца я счастливый обладатель Jetta VS5, машина радует и соответствует тому, что было озвучено и показано при подборе.",
    "telegramFileId": "telegram-import:2339",
    "image": null
  },
  {
    "title": "Отзыв 42",
    "text": "Доброго времени!\nВ данной фирме заказывали новый автомобиль Nissan Qashqai 2026г из Китая.Хочу выразить большую благодарность Павлу за высокий профессионализм и качественную поддержку на всем этапе сделки от оформления документов до самого момента получения автомобиля Заказчиком. Павел всегда на связи, оперативно реагировал на все возникающие вопросы. Были внеплановые вызовы на этапе растаможки автомобиля в РФ, где по непонятным причинам собственника могли вызвать лично на процедуру подачи документов, а это в Уссурийске.. спасибо Павлу, что этого не произошло, все прошло штатно, но с небольшим увеличением сроков. Так же благодаря Павлу в Китае автомобиль затянули в бронепленку, сделали антикоррозийную обработку, установили подогрев сидений и руля, укомплектовали салон ковриками. По стоимости вышло раза в 3 дешевле чем делать в РФ. Всем рекомендую данную фирму, обращайтесь, все прозрачно, без скрытых платежей и комиссий, огромное спасибо Вам и отдельно Павлу 🤝",
    "telegramFileId": "telegram-import:2343",
    "image": "/media/reviews/telegram-2343.webp"
  },
  {
    "title": "Отзыв 43",
    "text": "Доброго времени суток! Хочу выразить свою благодарность Компании ASIA TRADE CAR за подбор и доставку автомобиля. Автомобиль подобрали быстро, все в соответствии моим требованиям,доставка в срок. Спасибо Павлу, всегда был на связи. Все подробно объяснял и инструктировал. Буду рекомендовать друзьям и знакомым.",
    "telegramFileId": "telegram-import:2349",
    "image": "/media/reviews/telegram-2349.webp"
  },
  {
    "title": "Отзыв 44",
    "text": "Всех приветствую! Хочу выразить огромную благодарность Артуру и всем его коллегам. Автомобиль полностью соответствует видео обзору, автомобиль новый, целый и без скрытых сюрпризов. На учёт встала без проблем. Сделка от бронирования до получения заняла чуть менее месяца! По всем интересующим вопросам, были оперативные ответы! В общем и целом, радости нет предела) Однозначно рекомендую Вас своим друзьям и знакомым! С Вами приятно работать! Ну и конечно же процветания Вам всем, а я пошёл нюхать запах новой машины 😀",
    "telegramFileId": "telegram-import:2352",
    "image": "/media/reviews/telegram-2352.webp"
  },
  {
    "title": "Отзыв 45",
    "text": "Добрый вечер, хочу сказать огромное спасибо, компании Asia Trade Car, особенно Павлу Платонову за мой новый автомобиль. В этом году решила сделать себя подарок на день рождение. Ещё с весны начала искать как же осуществить мечту. Одна компания предлагала оплатить автомобиль, а ввести в Россию только через пол года. Чисто случайно в инстаграмме попала на страницу к Павлу. Решила позвонить и уточнить нюансы. Главное для меня было, чтобы машина была новая, без пробега за рубежом. Павел был всегда на связи и всегда отвечал на все вопросы, можно сказать терпел меня, даже когда я переспрашивала одно и тоже несколько раз. После оплаты машина уже через неделю была в Новосибирске. Также Павел сопровождал до места получения и теперь я счастливый обладатель нового RX300!!! Еще раз большое спасибо!!!!",
    "telegramFileId": "telegram-import:2357",
    "image": "/media/reviews/telegram-2357.webp"
  },
  {
    "title": "Отзыв 46",
    "text": "Здравствуйте!\n\nЯ хочу выразить огромную благодарность компании Asia Trade и, в частности, нашему менеджеру Олегу.\n\nМы с женой решили приобрести новый автомобиль. После нескольких месяцев поисков подержанных машин в России мы узнали от знакомых, что они заказали автомобили из Китая через Asia Trade и остались очень довольны.\n\nВыбор компании и Олега как специалиста, с которым можно работать, был очевиден. Однако мы не сразу определились с выбором модели. Олег был всегда на связи и предлагал самые подходящие варианты в рамках нашего бюджета.\n\nПервым вариантом была Octavia A8, но в нашем бюджете было не так много вариантов, поскольку нам была нужна определённая комплектация. После просмотра нескольких вариантов, мы пришли к выводу, что не сможем найти подходящий вариант в нашем бюджете. Но Олег предложил рассмотреть Sagitar. Оказалось, что этот автомобиль подходит нам по всем параметрам, а цена за максимальную комплектацию была такой же, как за Octavia в базовой.\n\nПосле просмотра нескольких вариантов мы определились с комплектацией. Через пару дней поисков нашелся вариант, который был даже сильно дешевле, чем мы планировали изначально. После тщательной проверки автомобиля мы приняли решение о покупке.\n\nОлег забронировал автомобиль, и через несколько дней мы его оплатили. Всё это время он был на связи и отвечал даже на наши вопросы, даже самые глупые.\n\nЧерез пару месяцев ожидания наш новый автомобиль уже был в Томске. Мы немного не успели в рейс знакомого на автовозе, поэтому доставка затянулась на пару недель, а так бы привезли ещё раньше.\n\nПо итогу, я могу смело рекомендовать компанию Asia Trade и нашего менеджера Олега. Следующий автомобиль мы обязательно закажем через них. Когда знакомые будут спрашивать, где я купил свой автомобиль, я с чистой совестью буду рекомендовать Asia Trade.\n\nСпасибо вам большое!",
    "telegramFileId": "telegram-import:2360",
    "image": null
  },
  {
    "title": "Отзыв 47",
    "text": "Всех приветствую.\nХочу выразить большую благодарность менеджеру Артуру, заказывал Renault Arkana , машина пришла оперативно и в точности как была заявлена.\nАртур занимался полным сопровождением и был 24/7 на связи для консультации, все отчёты и подбор автомобиля был согласован полностью, автомобиль был подобран с максимально минимальным пробегом и самой выгодной ценой,покупкой очень доволен и рад, всем советую данную компанию для заказов  авто, за такие деньги в России даже ладу Весту в полной комплектации не купить. 👍",
    "telegramFileId": "telegram-import:2365",
    "image": "/media/reviews/telegram-2365.webp"
  },
  {
    "title": "Отзыв 48",
    "text": "Здравствуйте, всем привет из города Уфа!!! Хотелось бы выразить огромную благодарность компании ASIA TRADE CAR, в частности лично Артуру. По моему запросу был приобретён и доставлен автомобиль марки Mazda Cx5. Покупка и подбор автомобиля происходила с учетом всех моих критериев и бюджета. Артур был на связи 24/7 огромное ему спасибо, да и всей команде огромная благодарность!!!! Удачи, роста и процветания вам ребята!!!!!",
    "telegramFileId": "telegram-import:2368",
    "image": "/media/reviews/telegram-2368.webp"
  }
] satisfies TelegramReviewSeed[];

export function getSeededReviewImage(telegramFileId: string) {
  return telegramReviewSeeds.find((review) => review.telegramFileId === telegramFileId)?.image;
}
